# taps
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# brew install
brew "aspell"
brew "binutils"
brew "chezmoi"
brew "cmake"
brew "cookiecutter"
brew "coreutils", link: true
brew "ctags"
brew "curl"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-no-frame-refocus", "with-native-comp"], link: true
brew "exa"
brew "fd"
brew "gawk"
brew "gcc"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gnuplot"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "libmpc"
brew "make", link: false
brew "openssl@1.1"
brew "pre-commit"
brew "readline", link: true
brew "ripgrep"
brew "sqlite3"
brew "terraform"
brew "tmux"
brew "tree"
brew "wget"
brew "zlib"

cask "alacritty"
cask "discord"
cask "docker"
cask "firefox"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "slack"
cask "spotify"
cask "whatsapp"
